In [2]:
import pandas as pd

In [3]:
# train.csv 파일 불러오기
train = pd.read_csv('train.csv', index_col = 'PassengerId')

In [5]:
# 데이터프레임에서 위에서 5개 정보
train.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# 데이터프레임에서 위에서 5개 정보
train.tail(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
# 각 컬럼의 갯수 확인
train.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

In [10]:
# 결측치 확인
train.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [35]:
# 타이타닉호 승객 중 성별 인원수
print(train.value_counts(['Sex']))
print(train['Sex'].value_counts())

Sex
male      577
female    314
dtype: int64
male      577
female    314
Name: Sex, dtype: int64

In [38]:
# 나이별 인원수
train.value_counts(['Age'])
print(train['Age'].value_counts())

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: Age, Length: 88, dtype: int64

In [37]:
# 선실별 인원수
train.value_counts(['Cabin'])
train['Cabin'].value_counts()

B96 B98        4
C23 C25 C27    4
G6             4
F33            3
C22 C26        3
              ..
E50            1
C104           1
B39            1
E58            1
C101           1
Name: Cabin, Length: 147, dtype: int64

In [26]:
# 사망/생존 별 인원수 
train.value_counts('Survived')

Survived
0           549
1           342
dtype: int64

In [39]:
train.value_counts('Age')

Age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Length: 88, dtype: int64

In [4]:
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(train['Age'], bins, labels=labels)

In [5]:
cats

PassengerId
1       청년
2       장년
3       중년
4       중년
5       중년
      ...
887     중년
888     청년
889    NaN
890     중년
891     중년
Name: Age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [6]:
train['cats'] = cats

In [7]:
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cats
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,청년
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,장년
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,중년
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,중년
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,중년
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,중년
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,청년
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,중년
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,중년

In [8]:
train['cats'].value_counts()

청년      218
중년      196
장년      195
미성년자     83
노년       22
Name: cats, dtype: int64

In [11]:
# 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고, 
# 각 그룹에 대해 '미성년자, '청년', '중년','장년','노년 승객의 비율을 구하라'

In [38]:
train['cats'].value_counts('Survived', ascending=False)

청년      0.305322
중년      0.274510
장년      0.273109
미성년자    0.116246
노년      0.030812
Name: cats, dtype: float64

In [55]:
surv0 = train[train['Survived']==0]
surv1 = train[train['Survived']==1]

In [56]:
train['cats'].value_counts()

청년      218
중년      196
장년      195
미성년자     83
노년       22
Name: cats, dtype: int64

In [103]:
surv0['cats'].value_counts()/surv0['cats'].count()

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: cats, dtype: float64

In [104]:
surv1['cats'].value_counts()/surv1['cats'].count()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: cats, dtype: float64

In [108]:
surv1['cats'].count()

290

In [109]:
surv0['cats'].count()

424